# Работа с БД SQLite

In [96]:
import sqlite3
from prettytable import from_db_cursor

In [97]:
import os
TEMP_DIR ='temp'
if not os.path.exists(TEMP_DIR):
    os.mkdir(TEMP_DIR)

In [98]:
# db_name = os.path.join(TEMP_DIR, 'temp_SQLite.db')
db_name = ':memory:'
print(db_name)

db= sqlite3.connect(db_name)
cur = db.cursor()

:memory:

In [99]:
cur.execute('CREATE TABLE cities (id integer PRIMARY KEY AUTOINCREMENT NOT NULL, name varchar(100) UNIQUE)')
db.commit()

In [100]:
cur.execute("PRAGMA table_info('cities')")
from_db_cursor(cur)

+-----+------+--------------+---------+------------+----+
| cid | name |     type     | notnull | dflt_value | pk |
+-----+------+--------------+---------+------------+----+
|  0  |  id  |   INTEGER    |    1    |    None    | 1  |
|  1  | name | varchar(100) |    0    |    None    | 0  |
+-----+------+--------------+---------+------------+----+

In [101]:
cur.execute("INSERT INTO cities(name) VALUES ('Севастополь')")
from_db_cursor(cur.execute("SELECT * FROM cities"))

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
+----+-------------+

In [102]:
cities = "Москва, Воронеж, Калуга".split(', ')
cities

['Москва', 'Воронеж', 'Калуга']

In [103]:
[(city,) for city in cities]

[('Москва',), ('Воронеж',), ('Калуга',)]

In [104]:
cur.executemany("INSERT INTO cities(name) VALUES (?)",[(city,) for city in cities])

In [105]:
from_db_cursor(cur.execute("SELECT * FROM cities"))

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
| 2  |    Москва   |
| 3  |   Воронеж   |
| 4  |    Калуга   |
+----+-------------+

In [106]:
sql = "INSERT INTO cities(name) VALUES (?)"
cur.execute(sql, ('Тула',))
cur.execute(sql, ('Ялта',))

from_db_cursor(cur.execute("SELECT * FROM cities"))

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
| 2  |    Москва   |
| 3  |   Воронеж   |
| 4  |    Калуга   |
| 5  |     Тула    |
| 6  |     Ялта    |
+----+-------------+

In [111]:
sql = "INSERT INTO cities(name) VALUES (:city)"
cur.execute(sql,{'city':'Гомель'})

from_db_cursor(cur.execute("SELECT * FROM cities"))

+----+----------------+
| id |      name      |
+----+----------------+
| 1  | г. Севастополь |
| 2  |   г. Москва    |
| 3  |   г. Воронеж   |
| 4  |   г. Калуга    |
| 5  |    г. Тула     |
| 6  |    г. Ялта     |
| 7  |     Гомель     |
+----+----------------+

In [110]:
sql = """
UPDATE cities
SET name = 'г. ' || name
WHERE name NOT LIKE 'г. %'
"""
cur.execute(sql)
from_db_cursor(cur.execute("SELECT * FROM cities"))

+----+----------------+
| id |      name      |
+----+----------------+
| 1  | г. Севастополь |
| 2  |   г. Москва    |
| 3  |   г. Воронеж   |
| 4  |   г. Калуга    |
| 5  |    г. Тула     |
| 6  |    г. Ялта     |
+----+----------------+

In [112]:
print(cur.execute("SELECT * FROM cities").fetchone())

(1, 'г. Севастополь')

In [113]:
print(cur.execute("SELECT * FROM cities").fetchmany(size=3))

[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж')]

In [114]:
print(cur.execute("SELECT * FROM cities").fetchall())

[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж'), (4, 'г. Калуга'), (5, 'г. Тула'), (6, 'г. Ялта'), (7, 'Гомель')]

In [116]:
print(cur.execute("SELECT * FROM cities LIMIT 3").fetchall())

[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж')]

In [120]:
t = cur.execute("SELECT * FROM cities").fetchall()
print(type(t))
print(t[:3])

<class 'list'>
[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж')]

In [119]:
from_db_cursor(cur.execute("SELECT * FROM cities"))

+----+----------------+
| id |      name      |
+----+----------------+
| 1  | г. Севастополь |
| 2  |   г. Москва    |
| 3  |   г. Воронеж   |
| 4  |   г. Калуга    |
| 5  |    г. Тула     |
| 6  |    г. Ялта     |
| 7  |     Гомель     |
+----+----------------+

In [118]:
print(*cur.execute("SELECT * FROM cities"))

(1, 'г. Севастополь') (2, 'г. Москва') (3, 'г. Воронеж') (4, 'г. Калуга') (5, 'г. Тула') (6, 'г. Ялта') (7, 'Гомель')